# LegacyShapefileExp

## Description
Use the old UI to export shape files.

```pascal
PROCEDURE LegacyShapefileExp;
```

```python
def vs.LegacyShapefileExp():
    return None
```

## Examples
```pascal
LegacyShapefileExp;
```
```python
import vs

# Use the old UI to export shape files.
vs.LegacyShapefileExp()
```

## Version
Availability: from Vectorworks 2012

## Category
* GIS